#여전히 DP문제 못푼다... 아아... 처음 생각했던 방법과 비슷했다는게 너무 아쉽다.

import sys
n = int(sys.stdin.readline())
mem = [0, 0, 1, 1] + [0] * (n+3)

for i in range(4, n+1):
    cnt = 10 ** 6
    if i % 3 == 0:
        cnt = min(mem[i//3], cnt)
    if i % 2 == 0:
        cnt = min(mem[i//2], cnt)

    mem[i] = min(mem[i-1], cnt) + 1

print(mem[n])

#반례
# 1284
# ans : 11
#
# 16
# ans : 4
#
#
# 40
# 정답: 5 (40 20 10 9 3 1)
# 출력: 6 (40 39 13 12 4 2 1)
#
# 41
# 정답: 6 (41 40 20 10 9 3 1)
# 출력: 7 (41 40 39 13 12 4 2 1)
#
# 52
# 정답: 6 (52 26 13 12 4 2 1)
# 출력: 52 (52 51 17 16 8 4 2 1)
#
# 76
# 정답: 6 (76 38 19 18 6 2 1)
# 출력: 7 (76 75 25 24 8 4 2 1)
#
# 80
# 정답: 6 (80 40 20 10 9 3 1)
# 출력: 7 (80 40 39 13 12 4 2 1)
#
#                 O   X   difference
# input : 963  -> 10  11  -1
# input : 1185 -> 11  12  -1
# input : 1281 -> 11	12	-1
# input : 1282 -> 11	11	0
# input : 1283 -> 12	12	0
# input : 1284 -> 11	12	-1
# input : 1285 -> 12	13	-1
# input : 1286 -> 12	13	-1
# input : 1287 -> 12	12	0
# input : 1288 -> 11	11	0
# input : 1289 -> 12	12	0
# input : 1290 -> 12	13	-1
# input : 1291 -> 13	14	-1
# input : 1292 -> 12	12	0
# input : 1293 -> 13	14	-1